In [2]:
import pandas as pd

In [3]:
dados = pd.read_excel("Dados.xlsx")

In [4]:
dados.head()

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion
0,1,EM,0,NaN,Ken,J,Sánchez,NaN,0
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0
4,5,EM,0,Ms.,Gail,A,Erickson,NaN,0

In [7]:
# selecionando uma ou n colunas por indice
dados["FirstName"].head()

0        Ken
1      Terri
2    Roberto
3        Rob
4       Gail
Name: FirstName, dtype: object

In [8]:
# exibindo duas colunas
dados[["FirstName", "MiddleName"]].head()

  FirstName MiddleName
0       Ken          J
1     Terri        Lee
2   Roberto        NaN
3       Rob        NaN
4      Gail          A

In [12]:
# adicionando mais uma coluna
dados['Complete_name'] = dados["FirstName"] + " " + dados["MiddleName"]

In [13]:
dados.head()

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,Complete_name
0,1,EM,0,NaN,Ken,J,Sánchez,NaN,0,Ken J
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1,Terri Lee
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0,NaN
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0,NaN
4,5,EM,0,Ms.,Gail,A,Erickson,NaN,0,Gail A